
// ВСПЛЫВАЮЩИЕ ОКНА
//alert ('ку'); // оповещалка
//confirm ('Примите куку');
/*
var qq = confirm ('Примите куку');
if (qq == true) {
  confirm ('Спс! :)');
} else {
  confirm ('Примите!');
}
*/

//var qq = prompt ('ку');
//console.log (qq);

// НАПОМИНАНИЕ СЕБЕ КАК РАБОТАТЬ С ЦИКЛАМИ И МАССИВАМИ
/*
let m = [213, 32132, 1123, 3213123, 321];
if (m[0]<m[1]) {
  console.log ('меньше');  
}
console.log (m[0]);
*/
//ПОИСК ЭЛЕМЕНТА В МАССИВЕ includes
/*//ПОИСК ЭЛЕМЕНТА В МАССИВЕ includes
let m = [213, 32132, 1123, 3213123, 321];
if (m.includes(321322) == true) {
  alert('ку');
} else {
  alert('не ку');
}
//СОРТИРОВКА МАССИВА
var m = ["мазда", "бмв", "митсубиши", "тойота", "хендай"];
m.sort(); // сортирует по алфавиту
m.reverse(); // меняет местами значения
console.log (m);

var age = [18, 18, 23, 12, 22, 30, 32, 12, 34, 14, 23, 46, 27, 35, 13, 24, 18, 18, 23, 12, 22, 30, 32, 12, 34, 14, 23, 46, 27, 35, 13, 24];
age.sort();
console.log (age);

for (var d = 0; d < 3; d++);
console.log (d);

let day = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];
for (z = 0; z < day.length; z++) {
console.log (z+1 +': '+ day[z]); // показывает количество элементов массива
};
console.log (day[5-1]);
*/