/*
//вывод в консоль
console.log ('Hello'); // просто вывод
console.error ('Hello'); // красная ошибка
console.warn ('Hello'); // уведомление
*/
//////////////////////////////////////////////////////////////////////////////////////
/*
//переменные
var num = 3; // присваивание данных переменной
num 5+5; // переписывание переменной и сумма
console.log ('Вычисление 5+5=' + num + ' уот так уот'); // вывод вычисления в консоль
const num = 7; // константы нельзя переписывать
summ = num + 5; // догически понял, что константе нужно присваивать другую переменную
console.log ('Вывод константы ' + num); // вывод фиксированной консты
console.log ('Вывод суммы ' + summ); // вывод новой переменной с суммой от консты
*/
//////////////////////////////////////////////////////////////////////////////////////
/*
//типы данных
var peremennaya = 1; //числовое значение
var peremennaya = 1.3; //числовое значение с точкой
var peremennaya = 'Строка'; //строчное значение string
var peremennaya = true; // булевое значение - верно
var peremennaya = false; // булевое значение - не верно
*/
//////////////////////////////////////////////////////////////////////////////////////
/*
//математические действия
var num1 = 5;
var num2 = 2;
var num3 = 2.4; //переменная с точкой
var num4 = 1;
var res = num1-num2;
console.log ("Результат без вычисления в консоли: " + res);
console.log ("Результат: " + (num1 - num2)); //вычитание
console.log ("Результат: " + (num1 + num2)); //сложение
console.log ("Результат: " + (num1 / num2)); //деление
console.log ("Результат: " + (num1 * num2)); //умножение
console.log ("Результат: " + (num1 % num2)); //остаток от деления
num3 = num3 + 25 //мат действие на себя
num2 += 1; //добавление числа 1 в сокращенном формате 1
num4 ++; //добавление числа 1 в сокращенном формате 2
console.log ('Результат суммы на себя: ' + num3);
console.log (num4);
//соединение строк
var srt_1 = "12";
var srt_2 = "1"; //строка добавляется к строке
str = srt_1 + srt_2;
console.log (str);
//из строк в числа
var srt_3 = Number("12"); //переделать строку в число
var srt_4 = Number("1"); //переделать строку в число
srt5 = srt_3 + srt_4;
console.log (srt5);
//Объект math.
console.log ('Math: ' + Math.PI); //математические решения Кос Син КТ и другое из документации
console.log ('Math: ' + Math.min (21312314, 12, 4124, 122, 421414, 12412412, 414212, 42534)); //вычислить минимальное значение
console.log ('Math: ' + Math.max (21312314, 12, 4124, 122, 421414, 12412412, 414212, 42534)); //вычислить максимальное значение
*/